{
  "pageTitle": "Mods SchoolMaker",
  "pageDescription": "Activez, désactivez et configurez des mods pour personnaliser votre expérience.",
  "enabledMods": "{count} mod activé | {count} mods activés",
  "howToUseTitle": "Comment utiliser cet outil",
  "step1": "Étape 1 : Activez et configurez les mods que vous souhaitez utiliser dans la liste ci-dessous.",
  "step2": "Étape 2 : Cliquez sur le bouton flottant \"Copier le code\" en bas à droite pour copier le script généré.",
  "step3": "Étape 3 : Dans votre tableau de bord d'administration SchoolMaker, allez dans <strong>Paramètres</strong> &gt; <strong>Code Personnalisé</strong>.",
  "step4": "Étape 4 : Collez le code copié dans la zone de texte intitulée <strong>&lt;head&gt; Custom Code</strong> et enregistrez vos modifications. Les mods seront actifs sur votre site.",
  "searchPlaceholder": "Rechercher des mods...",
  "categoryLabel": "Catégorie :",
  "all": "Tous",
  "appearance": "Apparence",
  "functionality": "Fonctionnalité",
  "tagsLabel": "Tags :",
  "clear": "Effacer",
  "noModsFound": "Aucun mod ne correspond à vos critères.",
  "whyTitle": "Pourquoi j'ai créé cet outil",
  "whyContent": "J'ai créé cet outil pour gérer et partager facilement des extraits de code JavaScript (mods) utiles qui personnalisent la plateforme SchoolMaker. Il simplifie le processus d'activation, de désactivation et de configuration de différentes fonctionnalités sans avoir à éditer manuellement le code. J'espère que vous le trouverez aussi utile que moi !",
  "generatedCodeTitle": "Code Généré",
  "generatedCodeDescription": "Voici le code généré pour tous les mods activés.",
  "copyCodeButton": "Copier le code ({count} activé)",
  "copiedToClipboard": "Copié dans le presse-papiers !",
  "copiedToClipboardDescription": "Vous pouvez maintenant coller le code dans votre projet.",
  "copyFailed": "La copie a échoué",
  "copyFailedDescription": "Impossible de copier le code dans le presse-papiers.",
  "configureTitle": "Configurer : {modName}",
  "configureDescription": "Ajustez les paramètres de ce mod. Cliquez sur enregistrer lorsque vous avez terminé.",
  "cancel": "Annuler",
  "saveChanges": "Enregistrer les modifications",
  "previewTitle": "Aperçu : {modName}",
  "previewDescription": "Un aperçu de ce que fait ce mod. Fermez la fenêtre lorsque vous avez terminé.",
  "footerDisclaimer": "Cette application n'est pas créée par SchoolMaker et n'est pas officielle. Elle est faite avec ♥ par Anthony de la communauté SchoolMaker."
}
